// 客户所属行业  ：快递、快运、三方物流、厂家、专线、区域运输、企业、快递快运
export const IndustryType = [
  "快递",
  "快运",
  "三方物流",
  "厂家",
  "专线",
  "区域运输",
  "企业",
  "快递快运"
];

// 客户性质 ：国有企业,民营公司,外商独资,中外合资,其他
export const CompanyType = [
  "国有企业",
  "民营公司",
  "外商独资",
  "中外合资",
  "其他"
];

// 客户运营模式
export const OperatingType = ["自营车队", "司机", "平台提供"];

// 业务类型
export const BusinessType = ["3PL业务", "票据业务", "后市场业务"];

// 下游结算方式
export const DownstreamSettlementType = [
  "背靠背",
  "谈定下游价格",
  "下游价格不固定"
];

// 票据需求方
export const DemandSideType = ["上游客户", "下游运输公司"];

// 车型：铁厢,铝厢,厢车,牵引车,自卸车,高强钢厢,高栏挂车,冷藏挂车,重型低平板半挂车,飞翼挂车
export const CarType = [
  "铁厢",
  "铝厢",
  "厢车",
  "牵引车",
  "自卸车",
  "高强钢厢",
  "高栏挂车",
  "冷藏挂车",
  "重型低平板半挂车",
  "飞翼挂车"
];

// 油品形式
export const OilType = ["地方加油站", "狮桥油卡"];

// 车长：4.2,6.0,7.1,7.6,9.6,13,13.5,14.6,16.1,16.5,17.5,20.5,25,25.5,26.3
export const CarLength = [
  4.2,
  6.0,
  7.1,
  7.6,
  9.6,
  13,
  13.5,
  14.6,
  16.1,
  16.5,
  17.5,
  20.5,
  25,
  25.5,
  26.3
];

// export const CarLength = [
//   "4.2",
//   "6.0",
//   "7.1",
//   "7.6",
//   "9.6",
//   "13",
//   "13.5",
//   "14.6",
//   "16.1",
//   "16.5",
//   "17.5",
//   "20.5",
//   "25",
//   "25.5",
//   "26.3"
// ];

export const ContractType = ["格式合同", "非格式合同"];

export const Provinces = [
  { code: "110000", name: "北京市" },
  { code: "120000", name: "天津市" },
  { code: "130000", name: "河北省" },
  { code: "140000", name: "山西省" },
  { code: "150000", name: "内蒙古自治区" },
  { code: "210000", name: "辽宁省" },
  { code: "220000", name: "吉林省" },
  { code: "230000", name: "黑龙江省" },
  { code: "310000", name: "上海市" },
  { code: "320000", name: "江苏省" },
  { code: "330000", name: "浙江省" },
  { code: "340000", name: "安徽省" },
  { code: "350000", name: "福建省" },
  { code: "360000", name: "江西省" },
  { code: "370000", name: "山东省" },
  { code: "410000", name: "河南省" },
  { code: "420000", name: "湖北省" },
  { code: "430000", name: "湖南省" },
  { code: "440000", name: "广东省" },
  { code: "450000", name: "广西壮族自治区" },
  { code: "460000", name: "海南省" },
  { code: "500000", name: "重庆市" },
  { code: "510000", name: "四川省" },
  { code: "520000", name: "贵州省" },
  { code: "530000", name: "云南省" },
  { code: "540000", name: "西藏自治区" },
  { code: "610000", name: "陕西省" },
  { code: "620000", name: "甘肃省" },
  { code: "630000", name: "青海省" },
  { code: "640000", name: "宁夏回族自治区" },
  { code: "650000", name: "新疆维吾尔自治区" },
  { code: "710000", name: "台湾省" },
  { code: "810000", name: "香港特别行政区" },
  { code: "820000", name: "澳门特别行政区" }
];
